from rich import print
from rich.console import Console

console = Console()

def print_picture(number):
    if number == '1':
        midoriya = r"""
        [bold cyan][bg black] 원포올 발동 중! [/bg black][/bold cyan]
        [bold yellow][italic rgb(0, 255, 0)]미도리야의 원포올[/italic rgb(0, 255, 0)] [underline]힘을 발산하는 순간![/underline]
        [bold rgb(255, 165, 0)]
    ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
    ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⢿⣿⣿⣿⣿⡿⣿⣿⣿⣿⣿⣿⡿⢿⣿⣿⣿⣿⣿⣿⣿⣿
    ⣿⣿⣿⣿⣿⣯⡝⡿⣿⣿⣿⣿⣿⣿⣿⣿⣏⣾⣿⣿⣿⣿⡙⣿⣿⣿⣿⣿⡿⣩⢻⣿⣿⣿⣿⣿⣿⣿⣿
    ⣿⣿⣿⣿⣿⣷⣝⡲⣍⠟⣿⣿⣿⢿⣿⣿⣿⡾⣿⣿⢣⠧⣹⣿⣿⣿⣻⠝⡲⢥⣿⣿⣿⣿⣿⣿⣿⣿⣿
    ⣿⣿⣿⣿⣿⠿⣿⣿⣿⣿⣴⡩⢟⣯⡿⣿⣿⣿⢿⡇⡞⣱⣿⣿⢣⢿⣿⠹⣵⡿⠿⢿⡛⢏⣶⣿⣿⣿⣿
    ⣿⣿⣿⢻⢿⣿⣴⣭⣙⠿⣿⣿⡿⣾⣟⡿⣿⣿⣯⡷⣝⣿⣿⡟⡡⢞⣏⢳⣿⡱⣍⡦⣙⡜⣿⣿⣿⣿⣿
    ⣿⣿⣿⣇⢎⡹⢛⢿⣿⣿⣻⢾⣽⣳⢯⢿⣳⣟⡾⣽⢯⡷⣯⣱⢋⡜⢧⣹⢾⣽⣻⡒⠥⡾⣛⠝⣶⣿⣿
    ⣿⣿⡿⢿⣾⡄⢋⢾⣽⡷⣯⣟⡾⣯⣟⣞⡿⣾⡽⣯⢿⡽⣾⢽⠢⡜⣦⢽⣛⣾⣳⠿⡑⢢⢡⣿⣿⣿⣿
    ⣿⣿⣿⣧⢎⡙⠂⡜⡻⣿⣳⢯⣟⣷⣻⢾⣽⣳⠿⣽⢯⣟⡷⣏⣲⢿⣹⡾⡽⢶⡋⡔⠣⣐⢫⣿⣿⣿⣿
    ⣿⣽⣿⣿⣿⡴⡁⠄⠱⢎⠽⣛⣾⣳⢯⣟⡶⣯⢿⣽⣻⢾⡽⣾⢽⣞⢷⡻⠍⡳⠌⠠⠑⡈⣽⣿⣿⣿⣿
    ⣿⣿⣽⢯⢶⣵⡈⠄⠁⠮⣀⠙⢶⣯⢟⣾⣳⢽⣛⣮⢷⣯⢿⡽⡾⣽⠞⣁⠶⠉⡀⢁⢢⣼⢿⣿⣿⣿⣿
    ⣿⣿⣿⣿⣎⢳⣯⣤⠁⠄⠈⠑⣮⣹⣟⡮⣟⡦⢿⣭⢿⡼⣯⣟⡽⣣⠞⠁⠂⡀⠐⣠⣟⢮⣿⣿⣿⣻⣿
    ⣿⣿⣿⣿⣿⣦⣅⠻⣦⣆⠈⠀⡙⠢⢋⠹⣶⢷⣻⢾⣯⣼⡷⠽⠎⠏⡀⢌⣰⣄⣷⣉⢾⣻⣿⣿⣿⣿⣿
    ⣿⣿⣿⣿⣿⣿⣽⣷⣿⣏⠓⠖⠰⠢⢄⠢⠝⢫⣰⣆⢚⠵⢩⣐⣀⠦⡜⠩⣐⢿⣳⣯⣿⣿⣿⣿⣿⣿⣿
    ⣿⣿⣿⣿⣿⣿⣿⣷⣯⣟⢦⠈⡄⢁⠂⡐⠈⠌⣷⢫⠁⠂⠄⠠⡀⠡⡐⣡⢮⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
    ⢿⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⣬⣡⢊⠤⣁⢂⠸⡁⢌⡐⢌⠤⣡⣳⣼⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
    ⣿⣿⢿⣿⣿⣿⣿⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿⣾⣷⣞⣶⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟⣷⣿
    ⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣻⣷⣿⣿⢣
    ⣽⣏⣿⣿⣾⣿⣿⣿⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟⣷⣿⢿⡳⢯⡘
    ⡿⣶⣫⣿⣿⣿⣯⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡙⢮⣽⣳⣬
        """
        console.print(midoriya)

# 메뉴 출력 함수
def print_menu():
    console.print("[bold yellow]그림 출력 프로그램[/bold yellow]")
    console.print("[cyan]================[/cyan]")
    console.print("[bold]1. 미도리야 원포올[/bold]")
    console.print("[bold]0. 종료[/bold]")
    console.print("[cyan]================[/cyan]")

# 메뉴와 그림 출력 실행
print_menu()
choice = input("번호를 입력하세요: ")
print_picture(choice)


